04_OpenFoam/_Tut_02/OpenFOAM-14/multicomponentFluid/simplifiedSiwek/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

source1
{
    type            fixedTemperature;

    timeStart       0.1;
    duration        0.4;

    cellZone
    {
        type        sphere;
        zoneType    cell;
        centre      (0.125 0.375 0.05);
        radius      0.005;
    }

    mode            uniform;

    temperature     2000;
}


// ************************************************************************* //
